cf/Catalogs/нсиНастройкиПоискаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>нсиНастройкиПоискаДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяСправочника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиВидыСправочников</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаКомпоновщика</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыНеточногоПоиска</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/нсиНастройкиПоискаДанных/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	нсиБизнесПроцессы.ЗаполнитьСписокСправочниковВедущихсяПоЗаявкам(Элементы.ИмяСправочника.СписокВыбора);
	
	Если не ЗначениеЗаполнено(Объект.ИмяСправочника) Тогда 
		Объект.ИмяСправочника = Параметры.ИмяСправочника;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.ИмяСправочника) Тогда 
		ЗаполнитьФорму(Параметры);
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТекущийОбъект.ПараметрыНеточногоПоиска = Новый ХранилищеЗначения(
		ПараметрыНеточногоПоиска.Выгрузить());
	ТекущийОбъект.НастройкаКомпоновщика 	= Новый ХранилищеЗначения(
		КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяСправочникаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ИмяСправочника) Тогда 
		ЗаполнитьФорму();
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыНеточногоПоиска

&НаКлиенте
Процедура ПараметрыНеточногоПоискаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Обработчик подсистемы "Сравнение данных"
	нсиСравнениеДанныхКлиент.ПараметрыНеточногоПоискаПеретаскивание(Объект.ИмяСправочника, 
		ПараметрыНеточногоПоиска, ПараметрыПеретаскивания); 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьФорму(ВходящиеДанные = Неопределено)
	
	// Обработчик подсистемы "Сравнение данных"
	нсиСравнениеДанныхСервер.ЗаполнениеКомпоновщикаНастроек(Объект.ИмяСправочника, 
		АдресКомпоновки, КомпоновщикНастроек, ЭтаФорма.УникальныйИдентификатор);
	
	Если ВходящиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	пЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	// заполняются по сохраненным данным
	Если ЗначениеЗаполнено(пЭтотОбъект.ПараметрыНеточногоПоиска.Получить()) Тогда 
		ПараметрыНеточногоПоиска.Загрузить(пЭтотОбъект.ПараметрыНеточногоПоиска.Получить());   
	КонецЕсли;
	Если ЗначениеЗаполнено(пЭтотОбъект.НастройкаКомпоновщика.Получить()) Тогда 
		КомпоновщикНастроек.ЗагрузитьНастройки(пЭтотОбъект.НастройкаКомпоновщика.Получить());
	КонецЕсли;
	
	// заполняются по полученным данным
	Если ЗначениеЗаполнено(Параметры.ПараметрыПоиска) Тогда 
		ПараметрыНеточногоПоиска.Загрузить(Параметры.ПараметрыПоиска.Выгрузить());   
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.НастройкаПоиска) Тогда 
		КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.НастройкаПоиска);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
